In [1]:
import pandas as pd

In [3]:
import os

In [7]:
os.chdir('/home/samar/')

In [8]:
df = pd.read_csv('HOMERRR/FRED/M/bop_trade_deficit.csv')

In [9]:
df.head()

   Unnamed: 0 realtime_start realtime_end        date   value
0           0     1997-01-17   1997-06-18  1992-01-01 -2031.0
1           1     1997-06-19   1998-06-17  1992-01-01 -2115.0
2           2     1998-06-18   1999-06-16  1992-01-01 -2087.0
3           3     1999-06-17   2000-06-19  1992-01-01 -1936.0
4           4     2000-06-20   2001-06-20  1992-01-01 -1824.0

In [11]:
df.set_index('date', inplace=True)

In [12]:
df2 = pd.read_csv('HOMERRR/FRED/M/m3_tbill.csv')

In [15]:
df2 = df2['value']

In [20]:
df2 = pd.read_csv('HOMERRR/FRED/M/m3_tbill.csv')

In [22]:
df2.set_index('date', inplace=True)

In [29]:
df3 = df.join(df2,on='date', how='outer', rsuffix='value2')

In [30]:
df3.head()

,date,Unnamed: 0,realtime_start,realtime_end,value,Unnamed: 0value2,realtime_startvalue2,realtime_endvalue2,valuevalue2
1992-01-01,1992-01-01,0.0,1997-01-17,1997-06-18,-2031.0,696,1996-12-03,9999-12-31,3.8
1992-01-01,1992-01-01,1.0,1997-06-19,1998-06-17,-2115.0,696,1996-12-03,9999-12-31,3.8
1992-01-01,1992-01-01,2.0,1998-06-18,1999-06-16,-2087.0,696,1996-12-03,9999-12-31,3.8
1992-01-01,1992-01-01,3.0,1999-06-17,2000-06-19,-1936.0,696,1996-12-03,9999-12-31,3.8
1992-01-01,1992-01-01,4.0,2000-06-20,2001-06-20,-1824.0,696,1996-12-03,9999-12-31,3.8

In [31]:
df3.to_csv('test_join.csv')

In [35]:
df3=df3.drop(columns=['realtime_start','realtime_end'])

In [36]:
df3.head()

,date,Unnamed: 0,value,Unnamed: 0value2,realtime_startvalue2,realtime_endvalue2,valuevalue2
1992-01-01,1992-01-01,0.0,-2031.0,696,1996-12-03,9999-12-31,3.8
1992-01-01,1992-01-01,1.0,-2115.0,696,1996-12-03,9999-12-31,3.8
1992-01-01,1992-01-01,2.0,-2087.0,696,1996-12-03,9999-12-31,3.8
1992-01-01,1992-01-01,3.0,-1936.0,696,1996-12-03,9999-12-31,3.8
1992-01-01,1992-01-01,4.0,-1824.0,696,1996-12-03,9999-12-31,3.8

In [37]:
df3=df3.drop(columns=['realtime_startvalue2','realtime_endvalue2'])

In [38]:
df3.head()

                  date  Unnamed: 0   value  Unnamed: 0value2  valuevalue2
1992-01-01  1992-01-01         0.0 -2031.0               696          3.8
1992-01-01  1992-01-01         1.0 -2115.0               696          3.8
1992-01-01  1992-01-01         2.0 -2087.0               696          3.8
1992-01-01  1992-01-01         3.0 -1936.0               696          3.8
1992-01-01  1992-01-01         4.0 -1824.0               696          3.8

In [39]:
df3=df3.drop(columns = ['Unnamed: 0', 'Unnamed: 0value2'])

In [40]:
df3.head()

                  date   value  valuevalue2
1992-01-01  1992-01-01 -2031.0          3.8
1992-01-01  1992-01-01 -2115.0          3.8
1992-01-01  1992-01-01 -2087.0          3.8
1992-01-01  1992-01-01 -1936.0          3.8
1992-01-01  1992-01-01 -1824.0          3.8

In [41]:
df1 = pd.read_csv('HOMERRR/FRED/M/iip.csv')

In [42]:
df2 = pd.read_csv('HOMERRR/FRED/M/us10y_cm.csv')

In [44]:
df1.set_index('date',inplace=True)
df2.set_index('date',inplace=True)

In [46]:
df3 = df1.join(df2,on='date', how='outer', rsuffix='_df2')

In [47]:
df3

                  date     value  value_df2
1919-01-01  1919-01-01    4.7770        NaN
1919-01-01  1919-01-01    4.9512        NaN
1919-01-01  1919-01-01    4.9739        NaN
1919-01-01  1919-01-01    4.9504        NaN
1919-01-01  1919-01-01    4.9286        NaN
...                ...       ...        ...
2021-01-01  2021-01-01  106.6941       1.08
2021-02-01  2021-02-01  104.9382       1.26
2021-02-01  2021-02-01  104.3827       1.26
2021-03-01  2021-03-01  105.7995       1.61
NaN         2021-04-01       NaN       1.64

[7355 rows x 3 columns]

In [48]:
df3.to_csv('test_join.csv')

In [49]:
df3.drop(columns='date', inplace=True)

In [51]:
df3.to_csv('test_join.csv')